[
  {
    "id": "dedalus",
    "company": "Dedalus Labs (YC S25)",
    "position": "Software Engineering Intern",
    "description": "I was the first hire at Dedalus Labs, a pre-seed YC-backed startup building unified MCP infrastructure for AI agent deployment. I contributed to the core platform enabling any LLM to connect with any MCP server through a single API endpoint. My work involved developing a React/Next.js frontend and Python FastAPI backend for Model Context Protocol integration. I also integrated authentication, billing, and database services, supporting the onboarding of early beta users.",
    "startDate": "Jun",
    "endDate": "Aug 2025",
    "location": "San Francisco, CA",
    "icon": "dedalus.jpeg"
  },
  {
    "id": "mapmycustomers",
    "company": "Map My Customers",
    "position": "Product Design Intern",
    "description": "I designed web and mobile interfaces in Figma, with 32 design tickets resulting in 250+ hours of dev work. I collaborated with engineering, product, and sales teams to align design decisions with business needs. I streamlined design processes by helping develop and maintain design systems and component libraries. I also guided the Mileage Tracking project from initial prototypes to final designs through the full UX research process.",
    "startDate": "Jun",
    "endDate": "Aug 2024",
    "location": "New York, NY",
    "icon": "mmc.png"
  },
  {
    "id": "appledeveloper",
    "company": "Apple Developer Program (Self-employed)",
    "position": "Indie iOS & visionOS Developer",
    "description": "I have published 4 apps on the App Store with 25K+ cumulative downloads, ranging from productivity tools to interactive simulations. I developed Planetaria, an AR/VR Solar System simulator using SwiftUI and RealityKit, which is available on Vision Pro. I open-sourced SwiftSPICE, a Swift package using NASA's SPICE Toolkit for accurate planetary ephemerides. I was selected as one of ~350 global winners of Apple's Swift Student Challenge in 2021 and attended WWDC23.",
    "startDate": "Apr 2020",
    "endDate": "Present",
    "location": "",
    "icon": "asc.jpg"
  }
] 